OdIfcGUID.generate
\details
Generates a new IFC GUID object (pseudo constructor).
\returns Returns the generated object.

OdIfcGUID.isValid
\details
Determines whether the IFC GUID value is valid.
\returns Returns true if the value is valid; otherwise the method returns false.

OdIfcGUID.c_str
\details
Returns a const pointer to underlying string.

OdIfcGUID.op_LessThan(OdIfcGUID!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Inequality operator for IFC GUID objects.
\param other [in] Another IFC GUID value to be compared with (right-hand operand.
\returns Returns true if the IFC GUID object is not equal to another IFC GUID object; otherwise, the method returns false.

OdIfcGUID.op_Inequality(OdIfcGUID!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Inequality operator for IFC GUID objects.
\param other [in] Another IFC GUID value to be compared with (right-hand operand.
\returns Returns true if the IFC GUID object is not equal to another IFC GUID object; otherwise, the method returns false.

OdIfcGUID.op_Equality(OdIfcGUID!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Comparison operator for IFC GUID objects.
\param other [in] Another IFC GUID value to be compared with (right-hand operand.
\returns Returns true if the IFC GUID object is equal to another IFC GUID object; otherwise, the method returns false.

OdIfcGUID.op_Assign(OdGUID!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Assignment operator for IFC GUID objects.
\param other [in] A new GUID value to be assigned.
\returns Returns a reference to the IFC GUID object modified with the assignment operation.

OdIfcGUID.op_Assign(OdAnsiString!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Assignment operator for IFC GUID objects.
\param s [in] A new IFC GUID value to be assigned represented as an ANSI string.
\returns Returns a reference to the IFC GUID object modified with the assignment operation.

OdIfcGUID.#ctor(OdGUID!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Creates a new IFC GUID object with existing OdGUID value.